import Navbar from "../Navbar/Navbar";
import Footer from "../footer/Footer";
import term from "./terms.module.css";

function Terms() {
  return (
    <div className={term.cont}>
      <Navbar style="backGroung" />

      <section className="container" dir="rtl">
        <h1>سياسة الخصوصية</h1>
        <p>
          أهلًا بك في سياسة خصوصية موقع موضوع ، يتم تشغيل وإدارة هذا الموقع من
          قبل الشركة المالكة له موضوع ليمتد و/ أو الشركات التابعة له
        </p>
        <h4>مقدمة</h4>
        <p>
          إنّ سياسة الخصوصية هذه تعلمك سياستنا فيما يتعلق بجمع واستعمال وإفشاء
          المعلومات الشخصية أثناء استعمالك للموقع بالإضافة للخيارات المتاحة لديك
          والمتعلقة بهذه المعلومات بموجب سياسة الخصوصية هذه حيث أن أولى
          اهتماماتنا هو حفاظ وضمان خصوصية استعمالك للموقع وخصوصية المعلومات
          المقدمة من قبلك على الموقع.
          <br />
          نحن نقوم باستعمال معلوماتك الشخصية لتقديم الخدمات المتاحة في الموقع
          وتحسينها و/أو تحسين استعمالك للموقع، وبمجرد استعمالك الموقع، أنت توافق
          على جمعنا للمعلومات واستعمالها وفقًا لهذه السياسة.
        </p>
        <br />

        <h4>تعريفات</h4>
        <br />
        <p>
          لغايات هذه السياسة، يكون للمصطلحات التالية المعاني المحددة لها كما
          يأتي ما لم تنص سياسة الخصوصية على خلاف ذلك:
        </p>
        <ul>
          <li>
            معلوماتك الشخصية: إنّ معلومات مستخدم الموقع سواء كانت هذه المعلومات
            بحوزتنا أو من المحتمل أن تصبح بحوزتنا.
          </li>
          <li>
            بيانات الاستعمال: وتعني أنّ البيانات المجمعة بشكل تلقائيّ سواء كانت
            ناتجة عن استعمال الموقع و/أو ناتجة عن بنية الموقع ذاتها (على سبيل
            المثال مدة زيارة الصفحة).
          </li>
          <li>
            مراقبة المعلومات: يعني نحن أو أي شخص طبيعي أو معنوي الذي يقرر (لوحده
            أو مع الغير) الغاية من معالجة المعلومات الشخصية أو الطريقة التي
            تعالج بها أو التي سيتم معالجتها بها.
          </li>
          <li>
            معالجي المعلومات (أو مقدمي الخدمات): وتعني أي شخص طبيعي أو معنوي
            يعالج المعلومات بالنيابة عن مراقب المعلومات.
          </li>
          <li>
            المستخدم: وهو أي شخص طبيعي يقوم باستخدام الخدمات و/أو الموقع وذات
            صلة بالمعلومات الشخصية.
          </li>
        </ul>
        <br />

        <h4>سياسة الخصوصية</h4>
        <br />
        <ol>
          <li>
            <h3> تجميع المعلومات واستعمالها:</h3>
            نحن نقوم بتجميع عدد كبير من المعلومات المتنوعة لغايات مختلفة وذلك
            لتقديم الخدمات المتاحة على الموقع لك وتحسينها وتشمل على سبيل المثال
            لا الحصر:
            <ul>
              <li>البريد الإلكتروني.</li>
              <li>الاسم الأول والاسم الأخير.</li>
              <li>رقم الهاتف.</li>
              <li>العنوان، والمنطقة، والمحافظة، والرمز البريدي، والمدينة.</li>
              <li>الكوكيز وبيانات الاستعمال.</li>
              <li>
                البيانات من الشبكات الاجتماعية إذا كنت تستخدم حسابات الشبكة
                الاجتماعية الخاصة بك للتسجيل وإنشاء حساب في الموقع، ومن
                المعلومات المستخدمة من مواقع الشبكات الاجتماعية مثل Facebook و
                Google+ و Twitter ما يلي:
                <ul>
                  <li>اسمك</li>
                  <li>اسم المستخدم للشبكة الاجتماعية.</li>
                  <li>الموقع</li>
                  <li>الجنس</li>
                  <li>تاريخ الميلاد.</li>
                  <li>عنوان البريد الإلكتروني.</li>
                  <li>صورة الملف الشخصي.</li>
                  <li>
                    البيانات العامة لجهات الاتصال وذلك إذا قمت بتوصيل حسابك أو
                    تسجيل الدخول للحصول على حساب في الخدمة باستخدام حساباتك في
                    هذه الشبكات الاجتماعية.
                  </li>
                </ul>
              </li>
            </ul>
            قد نستخدم معلوماتك الشخصية لإيصالك بالخدمات والمواد الإعلانية
            والترويجية ومعلومات أخرى أيًّا كان نوعها، والتي قد تكون من ضمن
            اهتماماتك سواء تم تطويرها من قبلنا لوحدنا أو من قبل أطراف ثالثة أو
            بالتعاون فينا بيننا وبين أي طرف ثالث.
          </li>
          <br />

          <li>
            <h3> بيانات الاستعمال:</h3>
            <br />

            <p>
              قد نعمل على تجميع المعلومات التي يقوم المتصفح الخاص بك ب‘رسالها
              عندما تقوم بزيارة الموقع أو دخولك له من خلال أو بواسطة جهاز هاتف
              نقال.
              <br />
              بيانات الاستعمال هذه قد تتضمن معلومات مثل: معلومات عنوان الإنترنت،
              والبروتوكول لجهاز حاسوبك، ونوع المتصفح، وإصدار المتصفح، وصفحات
              الموقع التي تقوم بزيارتها، ووقت وتاريخ زيارتك لها، والوقت الذي
              استغرقته على هذه الصفحات، ومعرفات الجهاز النادرة وغيرها من
              البيانات التشخيصية.
              <br />
              وعندما تقوم بالدخول للموقع من خلال جهاز هاتف محمول، قد تتضمن
              بيانات الاستعمال هذه معلومات مثل نوع جهاز الهاتف المحمول الذي
              تستعمله، ومعرف الهاتف الفريد الخاص بهاتفك المحمول، وعنوان الإنترنت
              والبروتوكول الخاص بهاتفك المحمول، ونوع متصفح الإنترنت عبر الهاتف
              المحمول المستعمل من قبلك ومعرفات الجهاز النادرة وغيرها من البيانات
              التشخيصية.
            </p>
          </li>
          <li>
            <h3> بيانات الموقع الجغرافي:</h3>
            <br />
            <p>
              قد نستعمل ونخزن معلومات عن موقعك إذا قمت بالسماح لنا بالقيام بذلك،
              ونستعمل هذه البيانات لتقديم مميزات متعلقة بخدمتنا ولتحسين الخدمة
              وتكييفها تبعًا لذلك، ويمكنكِ تفعيل أو عدم تفعيل خدمات الموقع
              الجغرافي عند استعمالك للخدمة بأي وقت من خلال إعدادات جهازك.
            </p>
            <br />
          </li>
          <li>
            <h3> بيانات الكوكيز والتتبع:</h3>
            <p>
              نحن نقوم باستعمال الكوكيز وتكنولوجيا تتبع مماثلة لتتبع النشاط على
              الموقع و نقوم بالاحتفاظ بمعلومات معينة.
              <br />
              وتُعرف الكوكيز على أنّها ملفات تحتوي على بيانات قليلة وقد تتضمن
              أدوات تعريف نادرة وغامضة، ويتم إرسال الكوكيز للمتصفح الخاص بك من
              الموقع الإلكتروني ويتم تخزينها على جهازك، ليتم استعمال تكنولوجيا
              تتبع من أنواع أخرى مثل البيكونات والعلامات المميزة والنصوص وذلك
              لغايات تجميع المعلومات وتتبعها وتطوير الخدمات وتحليلها.
              <br />
              بإمكانك تقييد المتصفح الخاص بك ليقوم برفض الكوكيز أو ليقوم بتحديد
              والإشارة إلى عملية إرسال كوكيز بأي حال من الأحوال، إذا كنت لا
              توافق على الكوكيز فإنك قد لا تتمكن من استعمال أجزاء معينة من
              الموقع.
            </p>
            <br />
          </li>
        </ol>
      </section>
      <Footer />
    </div>
  );
}
export default Terms;
