import Navbar from "../Navbar/Navbar";
import Footer from "../footer/Footer";
import term from "./terms.module.css";

function Terms() {
  return (
    <div className={term.cont}>
      <Navbar style="backGroung" />

      <section className="container" dir="rtl">
        <ol>
          <li>
            <h3> تجميع المعلومات واستعمالها:</h3>
            نحن نقوم بتجميع عدد كبير من المعلومات المتنوعة لغايات مختلفة وذلك
            لتقديم الخدمات المتاحة على الموقع لك وتحسينها وتشمل على سبيل المثال
            لا الحصر:
            <ul>
              <li>البريد الإلكتروني.</li>
              <li>الاسم الأول والاسم الأخير.</li>
              <li>رقم الهاتف.</li>
              <li>العنوان، والمنطقة، والمحافظة، والرمز البريدي، والمدينة.</li>
              <li>الكوكيز وبيانات الاستعمال.</li>
              <li>
                البيانات من الشبكات الاجتماعية إذا كنت تستخدم حسابات الشبكة
                الاجتماعية الخاصة بك للتسجيل وإنشاء حساب في الموقع، ومن
                المعلومات المستخدمة من مواقع الشبكات الاجتماعية مثل Facebook و
                Google+ و Twitter ما يلي:
                <ul>
                  <li>اسمك</li>
                  <li>اسم المستخدم للشبكة الاجتماعية.</li>
                  <li>الموقع</li>
                  <li>الجنس</li>
                  <li>تاريخ الميلاد.</li>
                  <li>عنوان البريد الإلكتروني.</li>
                  <li>صورة الملف الشخصي.</li>
                  <li>
                    البيانات العامة لجهات الاتصال وذلك إذا قمت بتوصيل حسابك أو
                    تسجيل الدخول للحصول على حساب في الخدمة باستخدام حساباتك في
                    هذه الشبكات الاجتماعية.
                  </li>
                </ul>
              </li>
            </ul>
            قد نستخدم معلوماتك الشخصية لإيصالك بالخدمات والمواد الإعلانية
            والترويجية ومعلومات أخرى أيًّا كان نوعها، والتي قد تكون من ضمن
            اهتماماتك سواء تم تطويرها من قبلنا لوحدنا أو من قبل أطراف ثالثة أو
            بالتعاون فينا بيننا وبين أي طرف ثالث.
          </li>
          <br />

          <li>
            <h3> بيانات الاستعمال:</h3>
            <br />

            <p>
              قد نعمل على تجميع المعلومات التي يقوم المتصفح الخاص بك ب‘رسالها
              عندما تقوم بزيارة الموقع أو دخولك له من خلال أو بواسطة جهاز هاتف
              نقال.
              <br />
              بيانات الاستعمال هذه قد تتضمن معلومات مثل: معلومات عنوان الإنترنت،
              والبروتوكول لجهاز حاسوبك، ونوع المتصفح، وإصدار المتصفح، وصفحات
              الموقع التي تقوم بزيارتها، ووقت وتاريخ زيارتك لها، والوقت الذي
              استغرقته على هذه الصفحات، ومعرفات الجهاز النادرة وغيرها من
              البيانات التشخيصية.
              <br />
              وعندما تقوم بالدخول للموقع من خلال جهاز هاتف محمول، قد تتضمن
              بيانات الاستعمال هذه معلومات مثل نوع جهاز الهاتف المحمول الذي
              تستعمله، ومعرف الهاتف الفريد الخاص بهاتفك المحمول، وعنوان الإنترنت
              والبروتوكول الخاص بهاتفك المحمول، ونوع متصفح الإنترنت عبر الهاتف
              المحمول المستعمل من قبلك ومعرفات الجهاز النادرة وغيرها من البيانات
              التشخيصية.
            </p>
          </li>
          <li>
            <h3> بيانات الموقع الجغرافي:</h3>
            <br />
            <p>
              قد نستعمل ونخزن معلومات عن موقعك إذا قمت بالسماح لنا بالقيام بذلك،
              ونستعمل هذه البيانات لتقديم مميزات متعلقة بخدمتنا ولتحسين الخدمة
              وتكييفها تبعًا لذلك، ويمكنكِ تفعيل أو عدم تفعيل خدمات الموقع
              الجغرافي عند استعمالك للخدمة بأي وقت من خلال إعدادات جهازك.
            </p>
            <br />
          </li>
          <li>
            <h3> بيانات الكوكيز والتتبع:</h3>
            <p>
              نحن نقوم باستعمال الكوكيز وتكنولوجيا تتبع مماثلة لتتبع النشاط على
              الموقع و نقوم بالاحتفاظ بمعلومات معينة.
              <br />
              وتُعرف الكوكيز على أنّها ملفات تحتوي على بيانات قليلة وقد تتضمن
              أدوات تعريف نادرة وغامضة، ويتم إرسال الكوكيز للمتصفح الخاص بك من
              الموقع الإلكتروني ويتم تخزينها على جهازك، ليتم استعمال تكنولوجيا
              تتبع من أنواع أخرى مثل البيكونات والعلامات المميزة والنصوص وذلك
              لغايات تجميع المعلومات وتتبعها وتطوير الخدمات وتحليلها.
              <br />
              بإمكانك تقييد المتصفح الخاص بك ليقوم برفض الكوكيز أو ليقوم بتحديد
              والإشارة إلى عملية إرسال كوكيز بأي حال من الأحوال، إذا كنت لا
              توافق على الكوكيز فإنك قد لا تتمكن من استعمال أجزاء معينة من
              الموقع.
            </p>
            <br />
          </li>
        </ol>
      </section>
      <Footer />
    </div>
  );
}
export default Terms;
